app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "open", "close", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 2]]

  def find_restaurant
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]