app/controllers/tables_controller.rb

  def create
    @table = Table.new(table_params)

    if @table.save
---
INSERT INTO "tables" ("number", "num_seats", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 1], ["num_seats", 4], ["restaurant_id", 1], ["created_at", "2019-02-22 12:53:08.564432"], ["updated_at", "2019-02-22 12:53:08.564432"]]

  def find_restaurant
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]